Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: །ལྷ་དང་མི་དཀྲིགས་ཕྲག་དགུ་བཅུ་རྩ་གཉིས་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་སྣ་ཚོགས་ཐོབ་པར་གྱུར་ཏོ།
en: Eighteen trillion gods and humans of many different types obtained the bodhisattva’s acceptance, absorption, and various dhāraṇīs.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ་ཉི་ཁྲི་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་མེ་ཏོག་གིས་གཏོར། རབ་ཏུ་གཏོར་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟར་མི་དགེ་བའི་གྲོགས་པོ་དང་འགྲོགས་པའི་དབང་གིས་སེམས་ཅན་རྣམས་བསོད་ནམས་ཐམས་ཅད་སོགས་པའི་དགེ་བའི་རྩ་བ་ཡིད་ལ་མི་བགྱིད་པ་ལ་གཟིགས་སུ་གསོལ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Subsequently, these twenty thousand bodhisattva great beings, who gained acceptance that phenomena are unborn, sprinkled celestial flowers toward and upon the Blessed One and, bowing their heads to his feet, said, “You see, O Blessed One, how beings attach no importance to the roots of virtue that lead to the accumulation of merit because of associating with nonvirtuous companions.”

source: འདི་ནི་ལས་ཀྱི་རྐྱེན་ཡིན་པར་བལྟའོ།
en: “This indeed ought to be understood as the karmic precondition,” the Blessed One agreed.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ངོ་མཚར་དུ་འགྱུར་བའི་སེམས་ཅན་རྣམས་ཐེ་ཙོམ་གཅད་པའི་ཕྱིར་སྔོན་བྱུང་བ་འདི་གསུངས་སོ།
en: And in order to remove the doubts of these astonished beings, he shared the following episode from one of his previous lives:

source: །རིགས་ཀྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་ཆེན་པོ་དཔག་ཏུ་མེད་པ་འདས་པ་དེའི་ཚེ་དེའི་དུས་ན་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཉིད་དུ་སྣང་བ་འཆང་བ་ཞེས་བྱ་བའི་བསྐལ་པ་ཆེན་པོ་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་དྲུག་ཁྲི་བརྒྱད་སྟོང་ཐུབ་སྟེ། དེའི་ཚེ་དེའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་འོད་ཞི་སྤོས་སྣང་དཔལ་ཞེས་བྱ་བ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ།
en: “In the distant past, O noble children, many immeasurable eons ago, in this world sphere consisting of the four continents, during the great eon called Glorious, when people lived sixty-eight thousand years, there was a thus-gone one by the name Splendorous with the Gentle Glow of Light and Fragrance.

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བྱུང་སྟེ།
en: He was a blessed buddha who was learned and virtuous, a blissful one, a knower of the world, an unsurpassed being, a charioteer who guides beings, and a teacher of gods and humans.

source: ཉོན་མོངས་པ་ཅན་སྙིགས་མ་ལྔའི་དུས་སུ་གྱུར་པ་ན། འཁོར་བཞི་ལ་ཐེག་པ་གསུམ་དང་ལྡན་པའི་ཆོས་སྟོན་ཏོ།
en: In the world of that time, afflicted with the five degenerations, he taught to a fourfold assembly the Dharma that comprises the three vehicles.

source: །ཡང་དེའི་ཚེ་གླིང་བཞི་ལ་དབང་བའི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཨུད་པ་ལའི་གདོང་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “At that time there also lived a king by the name Utpalavaktra, a universal monarch ruling over the four continents.

source: དེ་ནས་དུས་གཞན་ཞིག་གི་ཚེ་རྒྱལ་པོ་ཨུད་པ་ལའི་གདོང་བཙུན་མོའི་འཁོར་དང་གཡོག་དང་དཔུང་གི་ཚོགས་དང་བཅས་ཏེ་དེ་བཞིན་གཤེགས་པ་འོད་ཞི་སྤོས་སྣང་དཔལ་གང་ན་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་གཏོར་ཅིང་སིལ་སྙན་སྣ་ཚོགས་དང་། བདུག་པ་སྣ་ཚོགས་དང་། སྤོས་སྣ་ཚོགས་ཀྱིས་མཆོད་པ་བྱས་ནས་ལན་གསུམ་བསྐོར་ཏེ།
en: On one occasion, accompanied by his harem and army, he came to the place where the thus-gone Splendorous with the Gentle Glow of Light and Fragrance stayed. Having bowed his head to the feet of the Blessed One, he besprinkled him with flowers and worshiped him further with the sounds of various instruments, fragrances, and incense.

source: བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: He circumambulated him clockwise thrice, bowed his head to the feet of the assembly of his monks, and praised the Blessed One with these two stanzas: “ ‘O remover of many faults, you are praised

source: །ལྷ་དང་ཀླུ་ལ་སོགས་པའི་ཡོན་ཏན་གྱིས། །མངོན་པར་རབ་བསྟོད་ཉེས་པ་མང་སེལ་བ།
en: By the exceedingly virtuous gods, nāgas, and others!

source: །ནོར་བདུན་གྱིས་ནི་འགྲོ་ལ་ཕན་མཛད་པ།
en: O benefactor of beings with the aid of the seven spiritual treasures,

source: །གང་གིས་བློ་གྲོས་ཞི་དང་ལྡན་གྱུར་གསུངས།
en: Please explain how one attains a subtle mind!

source: །འགྲོ་བའི་མུན་སེལ་ཞི་བའི་སྒྲོན་མེ་མཛད།
en: ‘O remover of the world’s darkness and bringer of the light of peace,

source: །འཆི་འཕོ་ན་རྒ་སྐྱེ་བ་མྱ་ངན་འཇོམས།
en: Destroyer of transmigration and birth, and pacifier of the suffering of death,

source: །འགྲོ་བ་ངན་སོང་ལམ་ལས་རབ་བཟློག་པ།
en: You who turn beings back from the path of the less fortunate realms,

source: །གང་གིས་བདུད་ཀྱི་ལམ་ལས་ཐར་པ་གསུངས།
en: Please explain how to be released in this world from Māra ’s ways!’

source: །རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་འོད་ཞི་སྤོས་སྣང་དཔལ་དེས་རྒྱལ་པོ་ཨུད་པ་ལའི་གདོང་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: “In reply, O noble children, the thus-gone Splendorous with the Gentle Glow of Light and Fragrance said this to King Utpalavaktra:

source: །སྐྱེས་བུ་དམ་པ་ཆོས་གསུམ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་ཞི་བ་ཡིན་ཏེ།
en: ‘A person becomes a bodhisattva with a subtle mind when endowed with three qualities.

source: གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these three?

source: ལྷག་པའི་བསམ་པས་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བ་དང་། མ་ལྟ་བུར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་བྱ་བ་ལ་བརྩོན་པ་དང་། ཆོས་ཐམས་ཅད་ལ་སྲོག་མེད་པ་དང་། གསོ་བ་མེད་པ་དང་། གང་ཟག་མེད་པ་དང་། ཐ་དད་དུ་དབྱེར་མེད་ཅིང་མཉམ་པར་ཡོངས་སུ་རྟོག་པ་སྟེ། སྐྱེས་བུ་དམ་པ་ཆོས་གསུམ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་ཞི་བ་ཡིན་ནོ།
en: Out of a pure motivation, one feels compassion for all beings. ( ) Like a mother, one strives to remove their suffering. (3) One equally views all phenomena as being without self, the vital principle, or individuality and as being nondifferentiable and uncaused. Endowed with these three qualities, a good person will become a bodhisattva with a subtle mind.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་ཆོས་གསུམ་དང་ལྡན་ན། སྐྱེས་བུ་དམ་པ་བདུད་ཀྱི་ཞགས་པས་མི་ཟིན་ཅིང་བདུད་ཀྱི་ལམ་ལས་ཐར་ཏེ། གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ལ་མི་ཁྲོ་ཞིང་ཀླན་ཀ་མི་ཚོལ་བ་ཡིན།
en: “ ‘When endowed with another three qualities, O King, one will not become trapped in the snares of Māra. What are these three? One does not get angry with any sentient being and does not look for an opportunity to attack.

source: སེམས་ཅན་ཐམས་ཅད་ལ་མཚུངས་པར་སྦྱིན་གནས་སུ་འདུ་ཤེས་པ་ཡིན།
en: One sees all beings as equally worthy of generosity.

source: ཆོས་ཐམས་ཅད་ལ་ཚུལ་གཅིག་ཏུ་ཡོངས་སུ་རྟོག་སྟེ། འདི་ལྟར་ཆོས་ཐམས་ཅད་ནམ་མཁའ་དང་མཚུངས་ཤིང་བཅོས་སུ་མེད་པ། ཐ་དད་པ་མ་ཡིན་པ། མ་སྐྱེས་པ། མ་བྱུང་བ། མ་འགག་པ་སྟེ། ཆོས་ཐམས་ཅད་ནམ་མཁའ་ལྟ་བུར་རྫས་ཀྱི་མཚན་ཉིད་དང་བྲལ་བར་མི་དམིགས་པའི་ཚུལ་གྱིས་རབ་ཏུ་རྟོག་པའོ།
en: One examines all phenomena according to the single principle, and consequently views them as being the same as space—unfabricated, nondifferentiable, unborn, nonarising, and unceasing—and realizes them, without apprehending them, to be just like space in being devoid of any characteristics of substantiality.

source: །རྒྱལ་པོ་ཆེན་པོ་ཆོས་གསུམ་པོ་དེ་དག་དང་ལྡན་ན་སྐྱེས་བུ་དམ་པ་བདུད་ཀྱི་ཞགས་པས་མི་ཟིན་ཅིང་བདུད་ཀྱི་ལམ་ལས་ཐར་པ་ཡིན་ནོ།
en: With these three qualities, O King, a good person will not get entrapped in the snares of Māra and will be released from his ways.’

source: །དེ་ནས་དེའི་ཚེ་རྒྱལ་པོ་ཨུད་པ་ལའི་གདོང་གི་བཙུན་མོ་དམ་པ་ལྷ་མཛེས་ཞེས་བྱ་བ་བུད་མེད་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ཞིང་མདུན་དུ་བདར་ནས་དེ་བཞིན་གཤེགས་པ་འོད་ཞི་སྤོས་སྣང་དཔལ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཞི་སྤོས་སྣང་དཔལ་དེ་ལ་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་གཏོར་ཏེ། ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ།
en: “Now the chief queen of King Utpalavaktra, Surasundarī by name, served by a retinue of eighty-four thousand women, approached the blessed, thus-gone Splendorous with the Gentle Glow of Light and Fragrance and, sprinkling him with various flowers, uttered the following stanzas:

source: །མི་མཉམ་ཡོན་ཏན་འཛིན་པ་རབ་རིབ་མེད་མཛད་པ།
en: ‘O unequaled one, remover of darkness endowed with unique qualities,

source: །ཇི་ལྟར་བུད་མེད་ལས་ནི་ངན་སོང་སྤངས་པ་ཡི།
en: Destroyer of transmigration! Please explain how a young woman may,

source: །སྐྱེས་པར་འདིར་འགྱུར་འཆི་འཕོ་སེལ་བ་བཀའ་སྩོལ་ཅིག །རབ་མཆོག་ཕན་པ་མཛད་པ་མྱུར་དུ་ཡིད་ཀྱང་ཐུལ།
en: In this world, become a man, once purged of her less fortunate birth.

source: །དམ་པའི་འགྲོས་བཞུད་བདེ་གཤེགས་རབ་ཞི་དགའ་མཛད་པ།
en: O bringer of sublime benefits, gentle and disciplined in mind! “ ‘O blissful one who follows the highest course! He who pacifies and delights, Blessed One!

source: །བཅོམ་ལྡན་ཇི་ལྟ་བུར་ན་བུད་མེད་སྐྱེས་པར་འགྱུར།
en: How does a young woman give up her inferior birth and become a man in this world?

source: །འདུལ་མཆོག་གཞན་ལ་ཕན་མཛད་མྱུར་དུ་བཤད་པར་གསོལ།
en: Please explain this, O gentle and disciplined one who benefits others.

source: །བདག་གི་བློ་གྲོས་ཐིབས་པོ་འདིར་ནི་བསལ་བར་གསོལ།
en: Remove my mental darkness, right here and now.

source: །འཇིག་རྟེན་འདི་ན་མི་མཉམ་མཉམ་པ་དགེ་སྦྱོང་མཆོག །རབ་གྲགས་ཡོན་ཏན་མང་པོ་དྲན་དང་འདུལ་བ་འཛིན།
en: ‘O monk, unequaled in this world, Supreme receptacle of many renowned qualities, mindfulness, and discipline,

source: །ཅི་ནས་འདི་ཉིད་དུ་ནི་སྐྱེས་པར་བདག་འགྱུར་བར།
en: Promptly explain, O dispeller of darkness, the way in this world

source: །རབ་རིབ་མི་མངའ་བདེ་འགྲོ་འཆི་མེད་ལམ་མྱུར་གསུངས།
en: Whereby I could obtain a male birth—the elixir of happy migrations.’

source: །རིགས་ཀྱི་བུ་དག་དེ་སྐད་ཅེས་གསོལ་པ་དང་། དེ་བཞིན་གཤེགས་པ་འོད་ཞི་སྤོས་སྣང་དཔལ་དེས་བཙུན་མོ་དམ་པ་ལྷ་མཛེས་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: “Thus addressed, O noble children, the thus-gone Splendorous with the Gentle Glow of Light and Fragrance addressed Surasundarī, the chief queen:

source: །ཆེ་ཞེ་རྣམ་གྲངས་གང་གིས་བུད་མེད་དག་བུད་མེད་ཀྱི་དངོས་པོ་མྱུར་དུ་བརྗེས་ཏེ་སྔོན་འཕངས་པའི་བུད་མེད་ཀྱི་དངོས་པོ་མྱུར་དུ་མ་ལུས་པར་ཟད་པར་འགྱུར་ཞིང་།
en: ‘There is, O sister, a method whereby a woman may easily change her female sex.

source: བླ་ན་མེད་པའི་མྱ་ངན་ལས་འདས་པ་ཆེན་པོའི་བར་དུ་རང་གི་སྨོན་ལམ་མ་གཏོགས་པར་བུད་མེད་དུ་སྐྱེ་བ་འཛིན་པར་མི་འགྱུར་བའི་རྣམ་གྲངས་ཡོད་དོ།
en: Her previously acquired female sex will promptly disappear without a trace, and until the final nirvāṇa, she will not obtain a female form again, unless she aspires otherwise.

source: །ཆེ་ཞེ་དེ་ལ་རྣམ་གྲངས་གང་གིས་བུད་མེད་མྱུར་དུ་སྐྱེས་པར་འགྱུར་ཞིང་། སྔོན་འཕངས་པའི་བུད་མེད་ཀྱི་དངོས་པོ་མྱུར་དུ་མ་ལུས་པར་ཟད་པར་འགྱུར་བའི་རྣམ་གྲངས་དེ་གང་ཞེ་ན།
en: So, sister, what is this method through which a woman may swiftly become a man and that causes her female sex to promptly disappear?

source: ཆེ་ཞེ་དེ་ལ་རིན་པོ་ཆེ་ཏོག་ཅེས་བྱ་བའི་གཟུངས།
en: For this, O sister, there is a dhāraṇī called Ratnaketu.

source: རྫུ་འཕྲུལ་ཆེན་མོ། ཕན་ཡོན་ཆེན་མོ། མཐུ་ཆེན་མོ་འདི་ལྟ་སྟེ།
en: It has great magical power, is highly beneficial, and is very powerful.

source: བུད་མེད་ཀྱི་དངོས་པོ་ཐམས་ཅད་ཟད་པར་བྱེད་ཅིང་ལུས་དང་། ངག་དང་། སེམས་ཀྱི་གནས་ངན་ལེན་གྱི་སྡུག་བསྔལ་རྣམ་པར་སྨིན་པ་མ་ལུས་པར་ཟད་པར་བྱེད་དོ།
en: It completely dispels the condition of being a woman and removes, without residue, all depravities of the body, speech, and mind that ripen as suffering.

source: །རིན་པོ་ཆེའི་ཏོག་གི་གཟུངས་འདི་ཐོས་མ་ཐག་ཏུ་བུད་མེད་རྣམས་ཀྱི་བུད་མེད་ཀྱི་དངོས་པོ་མ་ལུས་པར་འགྱུར་ཏེ།
en: ‘Through merely hearing this dhāraṇī, the state of being a woman will disappear without leaving a trace.

source: བུད་མེད་ཀྱི་དབང་པོ་མི་སྣང་ཞིང་སྐྱེས་པའི་དབང་པོར་སྐྱེ་བར་འགྱུར། སྐྱེས་པ་གཟུགས་བཟང་པོ་ཡན་ལག་ཐམས་ཅད་ཚང་བར་འགྱུར།
en: The female sex organs will disappear and male ones will appear. Also, the resulting male body will be beautiful in form and complete in every limb.

source: དྲང་ཞིང་ཞིབ་པ་ཤེས་པ་ལ་མཁས་པར་འགྱུར། ལུས་དང་། ངག་དང་། ཡིད་ཀྱིས་ལེགས་པར་བྱས་པའི་ལས་ཀྱི་མཐའ་དང་ལྡན་ཞིང་ལེགས་པར་སྤྱད་པ་སྤྱོད་པ་དང་། དགྲ་ཐམས་ཅད་ཐུལ་བར་འགྱུར་རོ།
en: He will be honest, skilled in subtle wisdom, and able to accomplish his tasks, whether they are physical, verbal, or mental. He will follow the right conduct and will defeat all his enemies.

source: །གང་གི་ཚེ་འདི་དང་ཚེ་རབས་ཕྱི་མ་ལ་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་སྡུག་བསྔལ་བ་མྱོང་བར་འགྱུར་བའི་ཉེས་པར་བྱས་པའི་ལས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་དེ་ཡོངས་སུ་ཟད་པར་འགྱུར་ཏེ།
en: And whatever fruits of bad actions may have been ripened for him and would be experienced as suffering with respect to the body, speech, or mind, whether in this or future lives, all of them will be dispelled, unless he has committed any of the five acts of immediate retribution, opposed the sacred Dharma, or reviled a noble one.

source: མཚམས་མེད་པ་བྱེད་པ་དང་། དམ་པའི་ཆོས་སྤོང་བ་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་དག་མ་གཏོགས་པར་དེ་དག་གི་བུད་མེད་ཀྱི་དངོས་པོའི་ལྷག་མ་ལུས་དེ་ཉིད་ལ་ཡོངས་སུ་ཟད་པར་འགྱུར་རོ།
en: However, the female sex of such evildoers would disappear, too.

source: །ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་གནས་ངན་ལེན་གྱི་རྣམ་པར་སྨིན་པ། ཚེ་གཞན་ལ་བུད་མེད་ཀྱི་དངོས་པོ་འགྲུབ་པར་བྱེད་པའི་ས་བོན་སྡུག་བསྔལ་རྣམ་པར་སྨིན་པ་མྱོང་བར་འགྱུར་བའི་ལས་ཀྱི་སྒྲིབ་པའི་ས་བོན་གྱི་རྒྱུ་འཐུན་པ་རི་རབ་ཙམ་ཡང་མ་ལུས་པར་ཡོངས་སུ་ཟད་པར་འགྱུར་རོ།
en: With regard to the residual womanhood that has persisted throughout consecutive lives, reactivated by its latent seeds that ripen to be experienced as suffering—womanhood resulting from the physical, verbal, and mental depravities and arising out of the karmic obscurations thus acquired—even if this residual womanhood were as big as Mount Sumeru, it would all dissipate completely.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟ་སྟེ།
en: Why is this?

source: སེམས་ཅན་རྣམས་ཀྱི་སྡུག་བསྔལ་རྣམ་པར་སྨིན་པའི་ལས་ཡོངས་སུ་ཟད་པར་བྱ་བ་དང་། དགེ་བའི་རྩ་བ་རྣམ་པར་སྤེལ་བའི་ཕྱིར་འདས་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཀྱང་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདི་བཤད་དེ་བྱིན་གྱིས་བརླབས་སོ།
en: “ ‘It is because this dhāraṇī, Ratnaketu by name, has been taught and blessed by all the thus-gone, worthy, perfect buddhas of bygone times, thus bringing mutual joy to them and the reciters. It has been praised, extolled, and described in superlative terms as the means for eliminating action that would ripen as the suffering of beings, and for increasing their roots of virtue.

source: །གཅིག་ལ་གཅིག་རྗེས་སུ་དགྱེས་སོ། །མངོན་པར་བསྟོད་དོ། །བསྔགས་སོ། །རབ་ཏུ་བསྔགས་སོ། །དེ་ལྟར་ཕྱོགས་བཅུ་ན་ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་དག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱང་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་སེམས་ཅན་རྣམས་ཀྱི་ཉེས་པར་བྱས་པའི་ལས་ཡོངས་སུ་ཟད་པར་བྱ་བ་དང་། དགེ་བའི་རྩ་བ་རྣམ་པར་འཕེལ་བར་བྱ་བའི་ཕྱིར་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདི་འཆད་དེ་རབ་ཏུ་བསྔགས་པའི་བར་དུ་མཛད་དོ།
en: ‘Whatever thus-gone, worthy, perfect buddhas there are presently in the ten directions, dwelling in their respective buddha fields, all of them teach this Ratnaketu dhāraṇī while recommending it as the means for eliminating bad action and increasing the roots of virtue of the beings in their buddha fields.

source: །གང་དག་མ་འོངས་པའི་དུས་ན་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་སོ་སོར་འབྱུང་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་སྡུག་བསྔལ་རྣམ་པར་སྨིན་པའི་ལས་ཡོངས་སུ་ཟད་པར་བྱ་བ་དང་། དགེ་བའི་རྩ་བ་རྣམས་སྤེལ་བའི་ཕྱིར། རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདི་འཆད་པར་འགྱུར་ཏེ། རབ་ཏུ་བསྔགས་པའི་བར་དུ་མཛད་པར་འགྱུར་རོ།
en: And whatever thus-gone, worthy, perfect buddhas will exist in the future in the ten directions, in their respective places they also will teach this Ratnaketu dhāraṇī while recommending it as the means for eliminating action that would ripen for beings as suffering, and of increasing their roots of virtue.

source: །ད་ལྟར་ང་ཡང་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདི་འཆད་དེ།
en: I also will presently teach the Ratnaketu dhāraṇī.

source: ཕྱོགས་བཅུ་ན་ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདི་འཆད་པ་རྣམས་ལ་ཡང་རྗེས་སུ་ཡི་རང་ངོ་། །བསྔགས་སོ། །རབ་ཏུ་བསྟོད་དོ།
en: Rejoicing in its being taught by the thus-gone ones arisen in the ten directions, I will praise and extol this dhāraṇī.

source: །ཆེ་ཞེ་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་སྐྱེ་བོའི་ནང་ན་མཐུ་དང་དབང་ཐོབ་པ་གང་ལ་ལས་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདི་གླེགས་བམ་དུ་བྲིས་ཏེ་འཆང་ན། རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་དེའི་སྙན་པ་དང་། སྒྲ་དང་ཚིགས་སུ་བཅད་པ་ཕྱོགས་བཅུར་རྒྱ་ཆེར་གྲགས་པར་འགྱུར་ཏེ། གཟུགས་ཀྱི་ཁམས་ཐམས་ཅད་ཀྱི་བར་དུ་སྒྲ་དང་། སྙན་པ་རྒྱ་ཆེན་པོས་གང་བར་འགྱུར་རོ།
en: ‘O sister, if any head-anointed kṣatriya king who has achieved power and dominion writes the Ratnaketu dhāraṇī and upholds it, stanzas of praise sung for such a king will spread far and wide throughout the ten directions, filling everywhere up to the realm of form with words of praise.

source: །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་དེ་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་། སྦ་བའི་ཕྱིར་ཕྱི་བཞིན་འབྲང་ཞིང་གནས་སོ།
en: Many thousands of millions of billions of gods, nāgas, yakṣas, and gandharvas will form a chain behind this kṣatriya king, standing abreast in order to guard and protect him.

source: །དེའི་ཡུལ་ཐམས་ཅད་དུ་འཐབ་མོ་དང་། རྩོད་པ་དང་། མུ་གེ་དང་། ནད་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། དུས་མ་ཡིན་པའི་རླུང་དང་། ཆར་པ་དང་། གྲང་བ་དང་། ཚ་བའི་ཉེས་པ་རབ་ཏུ་ཞི་བར་འགྱུར་རོ།
en: All the depravities, quarrels, famine, disease, invasions by foreign powers, untimely storms, torrential rains, and afflictions of heat and cold will completely cease in his kingdom.

source: །གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། སེང་གེ་དང་། མ་ཧེ་དང་། གླང་པོ་ཆེ་དང་། སྤྱང་ཀི་མ་རུངས་པ་ཐམས་ཅད་ཀྱང་གནོད་པར་མི་འགྱུར།
en: All the evil yakṣas, rākṣasas, lions, buffaloes, elephants, and wolves will become harmless.

source: དུག་དང་། ཁ་བ་དང་། ཚ་བ་དང་། སྣུམ་མེད་པ་དང་། རོ་མེད་པ་དང་། རྩུབ་པའི་སྡུག་བསྔལ་བ་རེག་ན་མི་བདེ་བར་འགྱུར་བའི་ཉེས་པ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཞི་བར་འགྱུར་རོ།
en: All the unpleasant problems experienced when coming into contact with poisonous, sharp, bitter, pungent, or tasteless substances, or the pain felt when touching rough objects, will completely cease.

source: །ནོར་དང་། འབྲུ་དང་། སྨན་དང་། འབྲས་བུ་དང་། འདབ་མ་དང་། མེ་ཏོག་ཐམས་ཅད་ཀྱང་རབ་ཏུ་སྐྱེ་ཞིང་རྣམ་པར་འཕེལ་ཏེ་སྣུམ་པ་དང་། རོ་ཞིམ་པོར་འགྱུར་རོ།
en: All wealth, on the other hand, will increase, and all crops, medicinal herbs, forest trees, fruits, and flowers will grow in abundance and thrive, succulent and delicious in taste.

source: །གལ་ཏེ་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་གཡུལ་དུ་ཉེ་བར་གནས་པའི་ཚེ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདིའི་གླེགས་བམ་རྒྱལ་མཚན་གྱི་རྩེ་མོ་ལ་བཏགས་ན། རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་དེས་ཕ་རོལ་གྱི་དམག་ཚོགས་ཐུབ་པར་འགྱུར་རོ།
en: ‘And if this head-anointed kṣatriya king should hoist a volume containing the Ratnaketu dhāraṇī on top of a banner when engaged in battle, he will defeat the hostile army.

source: །དེ་སྟེ་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་གཡུལ་དུ་ཞུགས་པ་གཉི་ག་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདིའི་གླེགས་བམ་རྒྱལ་མཚན་གྱི་རྩེ་མོ་ལ་ཐོགས་ན། དེ་གཉིས་གཅིག་ལ་གཅིག་དགའ་ཞིང་འཐུན་པར་བྱེད་པར་འགྱུར་རོ།
en: If two head-anointed kṣatriya kings should hoist a volume containing the Ratnaketu dhāraṇī on top of a banner when engaged in mutual war, they will come to a mutually satisfying settlement.

source: །དེ་ལྟར་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདི་ཡོན་ཏན་དང་། ཕན་ཡོན་མང་ངོ་། །གྲོང་ངམ།
en: Thus, the Ratnaketu dhāraṇī brings many benefits and advantages.

source: གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལ་ལར་མིའམ། རྐང་བཞི་པ་དག་ནའམ་དུས་མ་ཡིན་པར་འཆི་བའམ། གནོད་པ་ཞིག་དེར་བྱུང་ན་དེར་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདི་གླེགས་བམ་ལ་བྱས་ཏེ་མཆོད་པའི་ཡོ་བྱད་ཆེར་སྦྱར་ཏེ་བཞག་ལ།
en: ‘If there is any village, town, or marketplace in which untimely death or harm breaks out for humans, nonhuman beings, or animals, a volume containing the Ratnaketu dhāraṇī should be brought there and worshiped with many offerings.

source: ཤིན་ཏུ་ཁྲུས་བྱས་ཤིང་ལུས་རབ་ཏུ་བྱུགས་ཏེ་གོས་སར་པ་བགོས་ནས་ཚངས་པར་སྤྱད་དེ། སེང་གེའི་ཁྲི་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་གཏོར་བ། དྲི་སྣ་ཚོགས་ཀྱིས་བདུགས་པ། རོ་བྲོ་བ་སྣ་ཚོགས་ཀྱིས་བསྐོར་བ་ལ་འདུག་ལ། དེར་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདིའི་གླེགས་བམ་བཀླགས་ན་དེར་ནད་དང་དུས་མ་ཡིན་པར་འཆི་བ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར་རོ།
en: When it is brought, a celibate ascetic who has bathed, dried his body, and put on new garments should sit on a lion throne adorned with various flowers, censed with fragrant incense, and covered in foodstuffs of many tastes, and he should read the text aloud.

source: །དེར་འཇིགས་ཤིང་སྤུ་ཟིང་ཞེས་བྱེད་པ་དང་། ལྟས་ངན་པ་ཐམས་ཅད་མེད་པར་འགྱུར་རོ།
en: “ ‘Consequently, all the killing and untimely death will cease, and the bad omens that bring on fear and goosebumps will disappear.

source: །བུད་མེད་གང་ལ་ལ་བུ་འདོད་ན་དེས་ཁྲུས་བྱས་ཏེ་གོས་སར་པ་བགོས་ལ་ཚངས་པར་སྤྱོད་དེ། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པས་གླེགས་བམ་དེ་མཆོད་ལ། བདག་ཉིད་ཀྱང་སྟན་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་གཏོར་བ། དྲི་སྣ་ཚོགས་ཀྱིས་བདུགས་པ། རོ་བྲོ་བ་སྣ་ཚོགས་ཀྱིས་བསྐོར་བ་ལ་འདུག་ནས་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདི་བཀླགས་ན་དེས་བུ་རྙེད་པར་འགྱུར་རོ།
en: If any woman wishes to give birth to a son, she should commission a celibate ascetic, bathed and dressed in clean garments, to worship this text with flowers, fragrances, garlands, and scented oils, while himself sitting on a throne that is adorned with various flowers, censed with fragrant incense, and covered in foodstuffs of many tastes. She should have him read the Ratnaketu dhāraṇī aloud.

source: །དེ་བླ་ན་མེད་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བར་དུ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་རང་གི་སྨོན་ལམ་མ་གཏོགས་པར་དེ་ཉིད་དེའི་བུད་མེད་དུ་གྱུར་པའི་ཐ་མ་ཡིན་ནོ། །ཆེ་ཞེ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདི་ལས་ཐ་ན་ཚིགས་སུ་བཅད་པ་གཅིག་ཙམ་གང་ལ་ལའི་རྣ་ལམ་དུ་གྲགས་པ་ན་ཐ་ན་རི་དགས་དང་བྱའང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: She will give birth to a son, and her present life will be the last one as a woman until she has attained final nirvāṇa, unless she herself wishes this to be otherwise for the sake of bringing sentient beings to maturity. O sister, even by just hearing the words of the Ratnaketu dhāraṇī recited once, anyone, even deer or birds, will never again turn back from unsurpassed and perfect awakening.’ ”

source: །རིགས་ཀྱི་བུ་དག་དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་འོད་ཞི་སྤོས་སྣང་དཔལ་གྱི་ཞབས་གཡས་པའི་མཐེ་བོས་ལ་རེག་པར་མཛད་དེ།
en: Then the blessed, thus-gone Śākyamuni said, “O noble children, when the big toe of thus-gone Splendorous with the Gentle Glow of Light and Fragrance’s right foot touched the ground, the earth trembled six times.”

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་ཀྱང་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་ས་ཆེན་པོ་རྣམ་པ་དྲུག་ཏུ་གཡོས་པར་བྱིན་གྱིས་བརླབས་ནས་ཕྱོགས་བཅུ་དག་གི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། གྲུལ་བུམ་དང་། མི་དང་། མི་མ་ཡིན་པ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་རྣམས་ཤིན་ཏུ་སྐྲག་པ་སྐྱེས་པར་གྱུར་ཏོ།
en: As he said this, the thus-gone Śākyamuni blessed the earth in this buddha field so that it likewise trembled six times. Countless gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, pretas, piśācas, kumbhāṇḍas, humans, and nonhuman beings were terrified.

source: །སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདི་ཐམས་ཅད་ཀྱང་སྣང་བས་རྒྱ་ཆེར་ཁྱབ་པར་གྱུར་ཏེ།
en: The buddha field of the Sahā world was totally pervaded with a great light.

source: ལག་མཐིལ་ལྟ་བུར་མཉམ་པར་འདུག་ཅིང་། དེའི་ཚེ་ན་རི་དང་། ཤིང་དང་། རྩིག་པ་དང་། རི་རབ་དང་། ཁོར་ཡུག་དང་། ཁོར་ཡུག་ཆེན་པོ་ཡང་མི་སྣང་བར་གྱུར་ཏོ།
en: It became as even as the palm of the hand, and the mountains, forests, walls, Mount Sumeru, the world perimeter, and the great world perimeters all disappeared.

source: །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དེ་དག་ཀྱང་ས་གཡོས་པ་དང་། སྣང་བ་དེས་སྐྲག་པ་སྐྱེས་པར་གྱུར་ཏེ།
en: The gods, nāgas, and yakṣas were also terrified by the trembling of the earth and the flash of light.

source: བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་ཕྱོགས་བཞིར་བལྟས་པ་དང་། དེ་དག་ཐམས་ཅད་ཀྱིས་མདའ་རྒྱང་གང་ཙམ་ན་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་མཐོང་ནས།
en: Through the power of the Blessed One, looking into the four directions they noticed the Blessed One, the sage of the Śākyas, at about the distance of an arrow shot.

source: དེ་དག་ངོ་མཚར་དུ་གྱུར་ཏེ་ཐལ་མོ་སྦྱར་ནས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་བལྟའོ།
en: They were astonished, and gazed upon the Thus-Gone One, the sage of the Śākyas, with their palms joined together.
